[
  {
    "name": "AI Fundamentals",
    "description": "Core concepts and foundational principles of artificial intelligence, including basic definitions, historical context, and key terminology."
  },
  {
    "name": "Machine Learning",
    "description": "Algorithms and techniques that enable computers to learn and improve from experience without being explicitly programmed for every task."
  },
  {
    "name": "Deep Learning Architectures",
    "description": "Neural network-based models with multiple layers, designed to process complex patterns in high-dimensional data like images, audio, and text."
  },
  {
    "name": "Prompt Engineering",
    "description": "Techniques for designing and optimizing input prompts to guide large language models (LLMs) and other generative AI systems in producing desired outputs."    
  },
  {
    "name": "Natural Language Processing (NLP)",
    "description": "Techniques and models focused on understanding, processing, and generating human language — including tasks like tokenization, summarization, and translation."
  },
  {
    "name": "Computer Vision",
    "description": "AI techniques that enable machines to interpret and understand visual information from the world, including image recognition, object detection, and scene analysis."
  },
  {
    "name": "Generative AI",
    "description": "AI systems that can create new content, including text, images, audio, and video, based on patterns learned from training data."
  },
  {
    "name": "AI Ethics & Safety",
    "description": "Principles, guidelines, and practices for developing and deploying AI systems responsibly, addressing bias, fairness, transparency, and potential risks."
  },
  {
    "name": "LLMs & Transformers",
    "description": "Large language models and transformer architectures that power modern AI systems like GPT, BERT, and other state-of-the-art language understanding models."
  },
  {
    "name": "AI Tools & Platforms",
    "description": "Software frameworks, libraries, and platforms used for developing, training, and deploying AI models and applications."
  },
  {
    "name": "Robotics & Automation",
    "description": "AI applications in physical systems, including autonomous vehicles, industrial automation, and intelligent robotic systems."
  },
  {
    "name": "AI in Business",
    "description": "Commercial applications and business strategies for implementing AI, including use cases, ROI considerations, and industry-specific applications."
  }
]